### ONE HOT ENCODING

In [4]:
import pandas as pd

In [21]:
df = pd.read_csv('titanic.csv',usecols=['Sex'])

In [22]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [29]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0      True
1     False
2     False
3     False
4      True

In [19]:
df=pd.read_csv('titanic.csv',usecols=['Embarked'])

In [14]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [15]:
df.dropna(inplace=True)

In [16]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0       False        True
1       False       False
2       False        True
3       False        True
4       False        True